# CannotConvertTempToDouble Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConversionFailures..::..CannotConvertTempToDouble Property
BuiltInFailures..::..ConversionFailures Class See Also
---
Cannot convert temperature '[Temperate Value]' to double value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotConvertTempToDouble { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotConvertTempToDouble As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotConvertTempToDouble {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConversionFailures Class
Autodesk.Revit.DB Namespace